using LitJson;
namespace CG_Public
{
    /// <summary>
    /// 配置
    /// </summary>
    public static class CG_Config
    {
        //--------------------------------------------json配置

        /* 游戏中所有的文字 */
        public static JsonData label = CG_Games.LoadJson("Label");
        /// <summary>
        /// 游戏中所有的文字Json表
        /// </summary>
        public static JsonData LABEL {
            get{ return label; }
        }

        /* 选择角色界面 */
        private static JsonData selectrole = CG_Games.LoadJson("SelectRole");
        /// <summary>
        /// 选择角色属性Json表
        /// </summary>
        public static JsonData SELECTROLE
        {
            get { return selectrole; }
        }

        /* 游戏中所有的模型 */
        private static JsonData model = CG_Games.LoadJson("model");
        /// <summary>
        /// 游戏中所有的模型属性Json表
        /// </summary>
        public static JsonData MODEL
        {
            get { return model; }
        }

        /* 游戏中所有的加载资源路径配置 */
        private static JsonData resourcePath = CG_Games.LoadJson("RESPath");
        /// <summary>
        /// 游戏中所有的加载资源路径配置Json表
        /// </summary>
        public static JsonData RESPath
        {
            get { return resourcePath; }
        }

        private static JsonData package = CG_Games.LoadJson("Package");
        /// <summary>
        /// 等级升级送物品要求 JSon表
        /// </summary>
        public static JsonData Package
        {
            get { return package; }
        }
        //--------------------------------------------代码配置
        //用户名字
        private static char[] _flrsiname = { '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '陈', '楮', '卫', '蒋', '沈', '秦', '尤',
        '许', '何', '吕', '施', '张', '曹', '严', '华', '金', '魏', '陶', '姜', '谢', '邹', '喻', '柏', '水', '窦', '章', '苏',
        '潘', '葛', '奚', '范', '彭', '郎', '韦', '昌', '马', '苗', '凤', '花', '方', '任', '袁', '柳', '酆', '鲍', '史', '唐',
        '廉', '岑', '贺', '倪', '汤', '殷', '罗', '毕', '郝', '邬', '安', '常', '于', '时', '傅', '皮', '卞', '齐', '康', '余',
        '元', '卜', '顾', '孟', '平', '黄', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '毛', '禹', '狄', '米', '贝', '明', '臧',
        '伏', '成', '戴', '谈', '宋', '茅', '庞', '纪', '舒', '屈', '项', '祝', '董', '梁', '阮', '蓝', '闽', '席', '季', '麻',
        '强', '路', '娄', '危', '江', '童', '颜', '郭', '盛', '林', '刁', '锺', '徐', '丘', '骆', '夏', '蔡', '田', '樊', '胡',
        '凌', '霍', '万', '支', '柯', '昝', '管', '卢', '莫', '房', '裘', '缪', '干', '解', '应', '宗', '宣', '邓', '郁', '单',
        '杭', '洪', '诸', '左', '石', '崔', '吉', '钮', '龚', '嵇', '邢', '滑', '裴', '陆', '荣', '翁', '羊', '於', '惠', '甄',
        '家', '封', '羿', '储', '靳', '汲', '邴', '糜', '松', '段', '富', '巫', '乌', '焦', '巴', '弓', '隗', '山', '谷', '车',
        '侯', '蓬', '班', '仰', '秋', '仲', '伊', '宫', '仇', '栾', '暴', '甘', '斜', '厉', '戎', '武', '符', '刘', '景', '詹',
        '束', '龙', '幸', '司', '韶', '郜', '黎', '蓟', '薄', '宿', '白', '怀', '蒲', '邰', '从', '鄂', '咸', '籍', '赖', '卓',
        '蔺', '屠', '蒙', '乔', '阴', '郁', '胥', '能', '苍', '双', '莘', '党', '翟', '谭', '贡', '劳', '逄', '申', '堵', '冉',
        '宰', '郦', '雍', '桑', '桂', '濮', '牛', '寿', '通', '扈', '燕', '冀', '郏', '浦', '尚', '农', '别', '庄', '晏', '柴',
        '瞿', '阎', '充', '连', '茹', '习', '宦', '艾', '鱼', '容', '古', '易', '慎', '戈', '廖', '庾', '终', '居', '衡', '步',
        '都', '耿', '满', '弘', '国', '文', '寇', '广', '禄', '阙', '东', '沃', '利', '蔚', '越', '隆', '巩', '聂', '融', '辛',
        '那', '简', '饶', '空', '毋', '沙', '养', '鞠', '须', '丰', '关', '蒯', '相', '查', '后', '荆', '红', '竺', '权', '逑',
        '盖', '益', '桓', '公', '马', '官', '欧', '诸', '闻', '东', '皇', '尉', '羊', '公', '宗', '濮', '于', '太', '申', '仲',
        '轩', '令', '宇', '孙', '慕', '闾', '司', '司', '司', '督', '子', '端', '巫', '公', '乐', '壤', '公', '夹', '父', '谷',
        '楚', '阎', '法', '汝', '涂', '钦', '百', '东', '南', '归', '海', '羊', '微', '帅', '亢', '况', '后', '有', '琴', '左',
        '东', '西', '牟', '佘', '伯', '赏', '南', '哈', '谯', '年', '爱', '阳', '佟', '言', '福', '冯', '韩', '孔', '戚', '云',
        '鲁', '俞', '费', '薛', '滕', '乐', '伍', '和', '祁', '计', '熊', '杜', '贾', '梅', '高', '虞', '经', '丁', '包', '程',
        '荀', '芮', '井', '牧', '全', '宁', '祖', '叶', '印','晋', '岳', '商', '墨','杨', '雷', '勾', '朱' , 'の', '°', 'メ',
        '♂', 'ぁ', 'づ', 'ゞ', '①', 'い', '︶', 'μ', '¨', '↗', '．', 'シ', '〖', '㊣', '↓', 'Ж', 'ジ', 'ぜ', 'ㄋ', 'ん',
        '∞', '＆', '∑', 'Ｓ', 'お', 'ぷ', '"', 'れ', 'ゆ', 'ㄝ', 'ナ', '％', '⑩', '／', '︵', '⑥', '┅', 'ゼ', 'γ', 'ぉ', 'Ⅱ',
        '︿', '≠', 'え', 'ｅ', 'ラ', 'ザ', 'ｓ', 'ㄧ', 'ク', 'ま', 'ǐ', 'ギ', '＼', 'ひ', 'У', '┻', '┎', 'ヴ', 'や', '⒊',
        '〈', 'だ', 'Ｎ', 'ざ', '―', 'е', '〕', 'Ｒ', 'ガ', 'ぴ', 'ネ', 'ぶ', 'エ', 'Ｈ', '┿', 'ы', 'Α', '∫', '﹣', 'ゑ', 'パ',
        'ㄦ', 'ж', '、', '★', '】', '╮', '…', '℡', '※', '℃', '×', '╰', 'ê', 'ヤ', '￡', 'ヽ', '「', '￥', '≯', '（', 'じ',
        '∮', '╭', '○', '〗', '◎', '⑦', 'ぺ', 'ぐ', 'し', 'ξ', '╯', '︷', 'ο', '②', 'о', '￣', '□', '∨', 'ё', '④', 'ぅ',
        'な', 'ベ', 'α', 'ㄚ', 'か', '╬', '┏', 'ㄖ', 'み', 'ち', 'κ', 'せ', 'た', '☉', 'Ａ', '∩', 'き', '△', '﹍', '◢', '◣',
        'ｍ', 'ゃ', 'ぬ', 'わ', 'ポ', 'ε', '┍', '╳', '〞', '〉', 'よ', 'マ', '∧', 'Μ', '╆', 'ㄍ', '┮', 'を', 'レ', '┢', 'ㄅ',
        'ν', 'ォ', 'ｕ', '╁', 'ㄒ', 'も', '▕', '╀', 'ɑ', '。', '！', '【', '〃', '～', '『', '？', 'ˇ', 'è', 'ㄣ', 'ミ', 'í', '↑',
        '¤', '≮', 'ù', 'ú', 'ノ', 'ǒ', 'っ', '⒈', '≈', 'ζ', 'ü', 'ン', 'う', 'ī', '┈', '┌', 'ˊ', '－', '┽', '┾', '⑤', '゜',
        'ι', 'ˋ', '⑧', 'ー', '↙', 'イ', '〇', 'ふ', 'リ', 'ò', 'ゾ', 'η', 'ａ', 'Ｃ', 'β', 'Θ', '∷', 'は', '∽', 'ゅ', '⒐', 'ハ',
        'ッ', '∴', 'Ｅ', '≌', '┐', 'Ⅰ', 'ド', '〔', 'н', 'τ', '㈠', 'ト', 'タ', 'ぇ', '﹟', 'オ', 'л', 'Ъ', 'む', 'ｘ', 'Ｇ', 'Ｖ',
        'フ', 'Ｐ', '╊', 'г', '┑', '┦', 'М', 'チ', 'プ', 'т', 'Я', 'ｌ', '·', '→', '＄', '№', '』', 'é', '￠', '√', 'á', '◇',
        '″', 'ゝ', 'ル', '‖', '」', '＂', 'ω', '⊙', 'こ', '＃', 'り', '﹌', '╄', '┊', 'ヾ', '﹑', 'ě', '＿', 'ㄟ', 'ご', '"', '▁',
        '∝', 'ャ', '═', '︻', '③', 'ō', 'Ｍ', 'ｏ', '｀', 'く', 'ア', 'ソ', 'Ｙ', 'と', 'て', 'Ω', 'サ', 'ì', '⒉', '┄', '╲', 'Ｄ',
        'ィ', 'ペ', 'ｉ', 'に', 'χ', 'ㄓ', 'め', '⒋', 'ウ', 'ｒ', 'и', 'が', '┭', 'ろ', '﹒', 'そ', 'Ё', 'δ', '〝', 'Ю', 'ホ',
        '﹡', 'ｄ', '〤', 'バ', 'げ', '｜', '˙', 'ρ', 'π', 'ぎ', '﹠', 'ㄜ', 'ψ', 'グ', '┲', '┱', '＾', 'ゲ', '☆', '，', '々', '﹏', 'ó',
        '◆', '♀', '﹎', '§', 'à', 'つ', '↘', 'ㄨ', '〆', 'ぃ', '←', 'ァ', 'あ', 'ら', '━', '╃', '‰', '│', 'ē', '﹖', '：', 'べ', 'ヅ', 'ツ', '┆', 'ㄗ', '＊', '⌒', '┃', '⑨', 'м', 'ロ', '；',
        'へ', '⒎', 'ā', 'Ο', '╅', '╋', '∥', '┳', 'す', 'さ', '╱', 'ヘ', 'Ψ', '↖', '＇', 'Σ', 'キ', 'ス', 'る', '≡', '㈱', '∵', 'ｎ', 'ǎ', 'カ', 'で', '︱', '┓', 'σ', 'ゥ', 'Ｔ', '⒏', 'ニ', 'ｙ', 'ㄆ', '╉', 'ず', '∈', 'セ', '⊥', '㈦', 'ぢ', 'コ', 'Ｉ', '┼', '∠', 'ｃ', 'я', 'к', '⒌', 'Φ' };

        public static char[] _FIRSTNAME
        {
            get { return _flrsiname; }
        }
    }

}
